{
    "projects": [
        {
            "title": "Sliced",
            "live-url": "https://sliced.rachanastasia.vercel.app/",
            "client-repo": "https://github.com/Rachanastasia/sliced-client",
            "server-repo": "https://github.com/Rachanastasia/sliced-client",
            "stack": {
                "front-end": [
                    "React",
                    "CSS3",
                    "HTML5",
                    "Jest"
                ],
                "back-end": [
                    "Node.js",
                    "Express",
                    "Knex",
                    "PostgreSQL Database",
                    "Mocha",
                    "Chai",
                    "Supertest"
                ],
                "deployed": {
                    "front-end": "Vercel",
                    "back-end": "Heroku"
                }
            },
            "content": [
                "Sliced is an app that allows users to store recipes and scale them up or down based on their needs. The app uses a string parsing algorithm that picks up numbers and certain words at the beginning of a line. When a user creates a new recipe, they can view how their text is being parsed below in the preview. ",
                "Users can view their recipes and use the slider to scale the measurements between 1/4 and 2 times the original amount. Some units, including tablespoons and cups, scale down to smaller units with the amounts. Amounts divisible by 1/8 are displayed in fractions, and decimals are rounded to the third place. ",
                "To try out Sliced, log in with these credentials: test@gmail.com | test-password. View other people's recipes to test the scaling feature or click the plus at the top to make your own."
            ],
            "images":[
                {
                    "path":"/sliced-login.png",
                    "alt": "This screenshot of Sliced, a recipe scaling app, that shows the login screen."
                },
                {
                    "path":"/sliced-add-recipe.png",
                    "alt": "This screenshot of Sliced, a recipe scaling app, that shows the add recipe screen with the ingredient parsing feature."
                },
                {
                    "path":"/sliced-scale-down.png",
                    "alt": "This screenshot of Sliced, a recipe scaling app, that shows a recipe scaled down"
                },
                {
                    "path":"/sliced-scale-up.png",
                    "alt": "This screenshot of Sliced, a recipe scaling app, that shows a recipe scaled up"
                }
            ]
        },
        {
            "title": "Petful",
            "live-url": "https://petful-client-template-eight.vercel.app/",
            "client-repo":"https://github.com/Rachanastasia/petful-client",
            "server-repo": "https://github.com/Rachanastasia/petful-server",
            "stack": {
                "front-end": [
                    "React",
                    "React Hooks",
                    "CSS3",
                    "HTML5"
                ],
                "back-end": [
                    "Node.js",
                    "Express",
                    "Knex",
                    "Queue data structure"
                ],
                "deployed": {
                    "front-end": "Vercel",
                    "back-end": "Heroku"
                }
            },
            "content": [
               "Petful is an app that simulates an adoption agency that only has room for one dog and one cat at a time. This app uses the queue data structure to temporarily store data on the users waiting to adopt and provide a continuous loop of cats and dogs.",
               "Once the user is in line to adopt, a pet gets adopted and replaced in the queue every five seconds. When the user is at the front of the line, they can adopt the current cat, dog, or both. Once it is the user's turn to adopt, a new person is added to the queue every five seconds.",
               "To try Petful, click on 'Adopt' and add your name to the queue."
            ],
            "images":[
                {
                    "path":"/petful-home.png",
                    "alt": "This screenshot of Petful, a pet adoption app, that shows the home screen."
                },
                {
                    "path":"/petful-register.png",
                    "alt": "This screenshot of Petful, a pet adoption app, that shows how the user adding their name to the queue."
                },
                {
                    "path":"/petful-queue.png",
                    "alt": "This screenshot of Petful, a pet adoption app, that shows the user in the adoption queue."
                },
                {
                    "path":"/petful-adopted.png",
                    "alt": "This screenshot of Petful, a pet adoption app, that shows the user adoptiong both pets."
                }
            ]
        },
        {
            "title": "Spaced Repetition",
            "live-url": "https://spaced-repetition-dun.vercel.app/",
            "client-repo": "https://github.com/Rachanastasia/spaced-repetition-client",
            "server-repo": "https://github.com/Rachanastasia/spaced-repetition-server",
            "stack": {
                "front-end": [
                    "React",
                    "CSS3",
                    "HTML5",
                    "Cypress"
                ],
                "back-end": [
                    "Node.js",
                    "Express",
                    "Knex",
                    "PostgreSQL Database",
                    "Linked list data structure",
                    "Mocha",
                    "Chai",
                    "Supertest"
                ],
                "deployed": {
                    "front-end": "Vercel",
                    "back-end": "Heroku"
                }
            },
            "content": [
                "Spaced Repetition is a language learning app that uses the spaced repetition technique to generate a sequence of Latin vocabulary words. If a word is answered incorrectly, it moves one place back in the list. Each time it is answered correctly, it moves twice as far back in the list as before.",
                "The spaced repetition technique is implemented using a linked list data structure. Each time a guess is made, a linked list is recursively generated on the api based on the 'next' pointer stored in the database. If a word is answered correctly, it's 'memory value' is doubled, and it moves back that many places in the list. If it's answered incorrectly, the word's memory value is reset to one, and it moves back one place in the list. Then the database is updated to reflect the movement of data in the linked list.",
                "To try out this program (and learn some Latin vocab), create an account or log in with these credentials: 'horatia' | 'pass' and click 'Start Learning'."
            ],
            "images":[
                {
                    "path":"/spaced-repetition-register.png",
                    "alt": "This screenshot of Spaced Repetition, a Latin vocabulary app, that shows the registration page."
                },
                {
                    "path":"/spaced-repetition-word-list.png",
                    "alt": "This screenshot of Spaced Repetition, a Latin vocabulary app, that shows a list of the user's words with the score."
                },
                {
                    "path":"/spaced-repetition-word.png",
                    "alt": "This screenshot of Spaced Repetition, a Latin vocabulary app, that shows a vocabulary word."
                },
                {
                    "path":"/spaced-repetition-correct.png",
                    "alt": "This screenshot of Spaced Repetition, a Latin vocabulary app, that shows the response after a user answers correctly."
                },
                {
                    "path":"/spaced-repetition-incorrect.png",
                    "alt": "This screenshot of Spaced Repetition, a Latin vocabulary app, that shows the response after a user answers incorrectly."
                }
            ]
        },
        {
            "title": "Init",
            "live-url": null,
            "client-repo": "https://github.com/trevorjalt/init-client",
            "server-repo": "https://github.com/trevorjalt/init-api",
            "stack": {
                "front-end": [
                    "React",
                    "CSS3",
                    "HTML5",
                    "Jest"
                ],
                "back-end": [
                    "Node.js",
                    "Express",
                    "Knex",
                    "PostgreSQL Database",
                    "Mocha",
                    "Chai",
                    "Supertest"
                ],
                "deployed": {
                    "front-end": "Vercel",
                    "back-end": "Heroku"
                }
            },
            "content": [
                "Init is a social media site for developers to share their work. Users can make posts with images, links, and a description. Users can follow other users. Users can view all the posts of the other users they follow in the feed, or they can view any user's post on their user profile."
            ],
            "images":[]
        }
    ],
    "about":[]
}